# BasicFileInfo Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BasicFileInfo Properties
BasicFileInfo Class See Also
---
The BasicFileInfo type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AllLocalChangesSavedToCentral | Are all local changes saved to the central file? |
| CentralPath | Returns the central model path. |
| Format | The file format indicator (currently, the major release version such as "2019") used for saving the file. |
| IsCentral | Checks if the file is workshared and Central. |
| IsCreatedLocal | Checks if the file is local and created by RevitServerTool.exe. |
| IsInProgress | Checks if the file is workshared and is in process of becoming Central. |
| IsLocal | Checks if the file is workshared and Local. |
| IsSavedInCurrentVersion | Checks if the file is saved in the current version. |
| IsSavedInLaterVersion | Checks if the file is saved in a later version of Revit than the running Revit. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| IsWorkshared | Checks if the file is workshared. |
| LanguageWhenSaved | Return the language active for the last save |
| LatestCentralEpisodeGUID | This is the central model's episode GUID corresponding to the last reload latest done for this model. |
| LatestCentralVersion | This is the central model's version number corresponding to the last reload latest done for this model. |
| Username | Returns the username. |

# See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace